/**
 * Exercise 1-7, page 19
 * Упражнение 1.7, страница 31
 * 
 * Write a program to print the value of EOF.
 *
 * Напишите программу для вывода значения константы EOF.
 */

#include <stdio.h>

int main (void) {
	printf("EOF value : %d\n", EOF);
	return 0;
}
